Revit 2025 API
FabricationPartCompareType Enumeration
 Fabrication Part Comparison Types
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FabricationPartCompareType
Public Enumeration FabricationPartCompareType
public enum class FabricationPartCompareType
type FabricationPartCompareType
Members
Member name | Value | Description
CutType | 1 |  Compare Fabrication Cut Type data.
Material | 2 |  Compare Fabrication Material.
Specification | 3 |  Compare Fabrication Specification.
InsulationSpecification | 4 |  Compare Fabrication Insulation Specification.
MaterialGauge | 5 |  Compare Fabrication Material's Gauge.
DuctFacing | 6 |  Compare Fabrication Duct Facing Type.
Insulation | 7 |  Compare Fabrication Insulation Material.
Notes | 8 |  Compare Fabrication Notes field.
Filename | 9 |  Compare Fabrication Item Filename.
Description | 10 |  Compare Fabrication Description Field.
CID | 11 |  Compare Fabrication Custom Identifier (CID) number.
SkinMaterial | 12 |  Compare Fabrication Double Skin Material.
SkinGauge | 13 |  Compare Fabrication Double Skin Material Gauge.
Section | 14 |  Compare Fabrication Section field.
Status | 15 |  Compare Fabrication Status.
Service | 16 |  Compare Fabrication Service.
Pallet | 17 |  Compare Fabrication Pallet field.
BoxNo | 18 |  Compare Fabrication Box Number field.
OrderNo | 19 |  Compare Fabrication Order Number field.
Drawing | 20 |  Compare Fabrication Drawing name field.
Zone | 21 |  Compare Fabrication Zone field.
ETag | 22 |  Compare Fabrication ETag field.
Alt | 23 |  Compare Fabrication Alt field.
Spool | 24 |  Compare Fabrication Spool name field.
Alias | 25 |  Compare Fabrication Alias field.
PCFKey | 26 |  Compare Fabrication PCFKey field.
CustomData | 27 |  Compare all Fabrication Custom Data fields.
ButtonAlias | 28 |  Compare Fabrication Button Alias field.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace